# задача 1
example="Яблочный пирожок"
print(example)
print(example[0]) # первому символу соответствует буква Я
print(example[-1]) # отрицательное значение используется для счета с конца строки,с последнего символа в данном случае
print(len(example)) # функция используемая для подсчета кол-ва символов в строке
print(example[1:16:3])
print(example[::-1])# мы ставим два двоеточия оставив пустым начало и конец и шаг,чтоб слово написать на оборот
print(example[1:16:2]) #счет в строке начинается с нуля,соответственно первому символу 0 соотоветстует буква Я
#
#